import ImageProvider from 'assets';
import { ImageSourcePropType } from 'react-native';

export type ProjectsDataType = {
  id: number;
  latitude: number;
  longitude: number;
  age: number;
  city_country: string;
  district: string;
  title: string;
  total_donation: number;
  donation_received: number;
  description: string;
  cover_image: ImageSourcePropType;
  donate_url: string;
};

export const ProjectsData: ProjectsDataType[] = [
  {
    id: 12,
    latitude: 25.036919,
    longitude: 121.571801,
    age: 10,
    city_country: '台北市',
    district: '信義區',
    title: '阿佐想擁有手機1',
    total_donation: 100000,
    donation_received: 0,
    description:
      '1底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電',
    cover_image: ImageProvider.WishMap.ProjectCoverImage1,
    donate_url:
      'https://www.makeawish.org.tw/products/%E9%A1%98%E6%9C%9B%E6%88%90%E7%9C%9F-%E7%BF%BB%E8%BD%89%E7%94%9F%E5%91%BD-%E7%82%BA%E9%87%8D%E7%97%87%E7%97%85%E7%AB%A5%E5%AF%A6%E7%8F%BE%E9%A1%98%E6%9C%9B',
  },
  {
    id: 2,
    latitude: 25.078267,
    longitude: 121.55144,
    age: 10,
    city_country: '台北市',
    district: '中山區',
    title: '阿佐想擁有手機2',
    total_donation: 100000,
    donation_received: 60000,
    cover_image: ImageProvider.WishMap.ProjectCoverImage1,
    description:
      '2底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電',
    donate_url:
      'https://www.makeawish.org.tw/products/%E9%A1%98%E6%9C%9B%E6%88%90%E7%9C%9F-%E7%BF%BB%E8%BD%89%E7%94%9F%E5%91%BD-%E7%82%BA%E9%87%8D%E7%97%87%E7%97%85%E7%AB%A5%E5%AF%A6%E7%8F%BE%E9%A1%98%E6%9C%9B',
  },
  {
    id: 3,
    latitude: 24.973932,
    longitude: 121.530429,
    age: 9,
    city_country: '新北市',
    district: '新店區',
    title: '阿佐想擁有手機3',
    total_donation: 100000,
    donation_received: 70000,
    cover_image: ImageProvider.WishMap.ProjectCoverImage1,
    description:
      '3底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電43',
    donate_url:
      'https://www.makeawish.org.tw/products/%E9%A1%98%E6%9C%9B%E6%88%90%E7%9C%9F-%E7%BF%BB%E8%BD%89%E7%94%9F%E5%91%BD-%E7%82%BA%E9%87%8D%E7%97%87%E7%97%85%E7%AB%A5%E5%AF%A6%E7%8F%BE%E9%A1%98%E6%9C%9B',
  },
  {
    id: 4,
    latitude: 24.969929,
    longitude: 121.545897,
    age: 17,
    city_country: '新北市',
    district: '中和區',
    title: '阿佐想擁有手機4',
    total_donation: 100000,
    donation_received: 80000,
    cover_image: ImageProvider.WishMap.ProjectCoverImage1,
    description:
      '4底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電',
    donate_url:
      'https://www.makeawish.org.tw/products/%E9%A1%98%E6%9C%9B%E6%88%90%E7%9C%9F-%E7%BF%BB%E8%BD%89%E7%94%9F%E5%91%BD-%E7%82%BA%E9%87%8D%E7%97%87%E7%97%85%E7%AB%A5%E5%AF%A6%E7%8F%BE%E9%A1%98%E6%9C%9B',
  },
  {
    id: 5,
    latitude: 24.962273,
    longitude: 121.511342,
    age: 15,
    city_country: '新北市',
    district: '新店區',
    title: '阿佐想擁有手機5',
    total_donation: 100000,
    donation_received: 90000,
    cover_image: ImageProvider.WishMap.ProjectCoverImage1,
    description:
      '5底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電',
    donate_url:
      'https://www.makeawish.org.tw/products/%E9%A1%98%E6%9C%9B%E6%88%90%E7%9C%9F-%E7%BF%BB%E8%BD%89%E7%94%9F%E5%91%BD-%E7%82%BA%E9%87%8D%E7%97%87%E7%97%85%E7%AB%A5%E5%AF%A6%E7%8F%BE%E9%A1%98%E6%9C%9B',
  },
  {
    id: 6,
    latitude: 25.055042,
    longitude: 121.511563,
    age: 6,
    city_country: '台北市',
    district: '大同區',
    title: '阿佐想擁有手機6',
    total_donation: 100000,
    donation_received: 90000,
    cover_image: ImageProvider.WishMap.ProjectCoverImage1,
    description:
      '6底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電',
    donate_url:
      'https://www.makeawish.org.tw/products/%E9%A1%98%E6%9C%9B%E6%88%90%E7%9C%9F-%E7%BF%BB%E8%BD%89%E7%94%9F%E5%91%BD-%E7%82%BA%E9%87%8D%E7%97%87%E7%97%85%E7%AB%A5%E5%AF%A6%E7%8F%BE%E9%A1%98%E6%9C%9B',
  },
  {
    id: 7,
    latitude: 25.020061,
    longitude: 121.55548,
    age: 13,
    city_country: '台北市',
    district: '大安區',
    title: '阿佐想擁有手機7',
    total_donation: 100000,
    donation_received: 90000,
    cover_image: ImageProvider.WishMap.ProjectCoverImage1,
    description:
      '7底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電',
    donate_url:
      'https://www.makeawish.org.tw/products/%E9%A1%98%E6%9C%9B%E6%88%90%E7%9C%9F-%E7%BF%BB%E8%BD%89%E7%94%9F%E5%91%BD-%E7%82%BA%E9%87%8D%E7%97%87%E7%97%85%E7%AB%A5%E5%AF%A6%E7%8F%BE%E9%A1%98%E6%9C%9B',
  },
];

export type WishDataType = {
  id: number;
  cover_image: ImageSourcePropType;
  donate_url: string;
  title1: string;
  subTitle1: string;
  description1: string;
  subTitle2: string;
  description2: string;
  subTitle3: string;
  description3: string;
  subTitle4: string;
  description4: string;
  title2: string;
  content2: string;
  title3: string;
  content3: string;
  title4: string;
  content4: string;
};

export const WishData: WishDataType = {
  id: 1,
  cover_image: ImageProvider.WishMap.WishDetailCoverImage,
  donate_url: 'https://www.makeawish.org.tw/collections/donate',
  title1: '喜願理念',
  subTitle1: '服務宗旨',
  description1:
    '協助台灣地區 3 歲以上未滿 18 歲的重症病童實 現心中最大的願望。\n我們深信願望成真將為喜願兒及其家人帶來翻轉生命的力量。',
  subTitle2: '喜願願景',
  description2: '喜願的願景是協助每一位罹患威脅生命疾病的重症病童圓夢。',
  subTitle3: '圓夢影響力',
  description3:
    '根據喜願基金會(MAKE-A-WISH FOUNDATION®)的調查，許多家長及醫護人員都認為：「願望成真是讓重症病童在對抗病魔的過程中，很重要的正向轉折點，圓夢之後的喜願兒，在生理及心理上均增強了對抗重症所需要的力量。」',
  subTitle4: '喜願在台灣 ( Make-A-Wish Taiwan)',
  description4:
    '喜願協會在台灣成立28年來，已幫助超過2,300位罹患威脅生命疾病的病童圓夢。\n透過實現心願的鼓勵，激發堅強的生命力，也與家人在抗病過程中凝聚愛與關懷的力量；對於參與圓夢的醫護、社工、志工及贊助者等，也因付出得到快樂，形成善的循環能量！\n喜願協會除了協助重症病童圓夢之外，與全國20家中大型醫院合作，定期關懷陪伴治療的重症病童，致力其身心照護，每年關懷服務約2000人次。\n經由醫院病床關懷及舉辦各類歡樂活動，陪伴長久住院之病童激發正面能量，緩解對疾病的不安，增加抗病力量！\n喜願協會曾連續榮獲內政部全國性社會團體工作績效評鑑「優等」及「甲等」殊榮，並於110年獲評內政部全國性「社會團體公益貢獻獎」之「銀質獎團體」殊榮。\n誠摯邀請各界愛心人士，與喜願一起點亮重症孩子的希望之光！',
  title2: '喜願在台灣 ( Make-A-Wish Taiwan)',
  content2:
    '喜願協會在台灣成立28年來，已幫助超過2,300位罹患威脅生命疾病的病童圓夢。\n透過實現心願的鼓勵，激發堅強的生命力，也與家人在抗病過程中凝聚愛與關懷的力量；對於參與圓夢的醫護、社工、志工及贊助者等，也因付出得到快樂，形成善的循環能量！\n喜願協會除了協助重症病童圓夢之外，與全國20家中大型醫院合作，定期關懷陪伴治療的重症病童，致力其身心照護，每年關懷服務約2000人次。\n經由醫院病床關懷及舉辦各類歡樂活動，陪伴長久住院之病童激發正面能量，緩解對疾病的不安，增加抗病力量！\n喜願協會曾連續榮獲內政部全國性社會團體工作績效評鑑「優等」及「甲等」殊榮，並於110年獲評內政部全國性「社會團體公益貢獻獎」之「銀質獎團體」殊榮。\n誠摯邀請各界愛心人士，與喜願一起點亮重症孩子的希望之光！',
  title3: '喜願緣起',
  content3:
    '西元 1980 年，在美國亞利桑那州有一位罹患白血病的 7 歲小男孩 Chris 夢想著能成為一位警察，當地的一位警察及社區人士便熱心地為 Chris 完成他的願望；Chris 穿上警察制服、配戴警徽，到街上巡邏、開違規停車的罰單 ... 像一位真正的警察去執行他的任務一般。\n幫助 Chris 實現心願的這一群人，感動於願望成真為小男孩帶來莫大的喜悅與歡樂，體會到重症病童在辛苦煎熬的治療過程中應有願望成真帶來的鼓舞，於是在 1980 年 4 月 29 日成立了喜願基金會 (Make-A-Wish Foundation®) 來為重症病童圓夢，並積極地向世界各地宣導喜願的理念而擴展成為國際性的組織。',
  title4: '喜願全球',
  content4:
    '★39個分會在全球五大洲近50個國家協助重症病童圓夢。\n\n★自1980至今，喜願全球已協助超過50萬個重症病童完成願望。\n\n★全球超過4萬5千名志工協助每年約2萬個圓夢。\n\n★2021年喜願國際組織，獲得美國最大獨立慈善評比機構Charity Navigator 4星級評比！',
};
