import ImageProvider from 'assets';
import { ImageSourcePropType } from 'react-native';

export type ProjectsDataType = {
  id: number;
  latitude: number;
  longitude: number;
  age: number;
  city_country: string;
  district: string;
  title: string;
  total_donation: number;
  donation_received: number;
  description: string;
  cover_image: ImageSourcePropType;
  tags?: string[];
};

export const ProjectsData: ProjectsDataType[] = [
  {
    id: 1,
    latitude: 24.979929,
    longitude: 121.533897,
    age: 10,
    city_country: '台北市',
    district: '信義區',
    title: '阿佐想擁有手機1',
    total_donation: 100000,
    donation_received: 50000,
    description:
      '1底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電',
    cover_image: ImageProvider.WishMap.ProjectCoverImage1,
    tags: ['白血病'],
  },
  {
    id: 2,
    latitude: 24.976929,
    longitude: 121.536897,
    age: 8,
    city_country: '台北市',
    district: '中山區',
    title: '阿佐想擁有手機2',
    total_donation: 100000,
    donation_received: 60000,
    cover_image: ImageProvider.WishMap.ProjectCoverImage1,
    description:
      '2底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電',
  },
  {
    id: 3,
    latitude: 24.972929,
    longitude: 121.542897,
    age: 8,
    city_country: '新北市',
    district: '新店區',
    title: '阿佐想擁有手機3',
    total_donation: 100000,
    donation_received: 70000,
    cover_image: ImageProvider.WishMap.ProjectCoverImage1,
    description:
      '3底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電43',
  },
  {
    id: 4,
    latitude: 24.969929,
    longitude: 121.545897,
    age: 33,
    city_country: '新北市',
    district: '中和區',
    title: '阿佐想擁有手機43',
    total_donation: 100000,
    donation_received: 80000,
    cover_image: ImageProvider.WishMap.ProjectCoverImage1,
    description:
      '44底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電',
  },
  {
    id: 5,
    latitude: 24.966929,
    longitude: 121.548897,
    age: 40,
    city_country: '新北市',
    district: '新店區',
    title: '阿佐想擁有手機5',
    total_donation: 100000,
    donation_received: 90000,
    cover_image: ImageProvider.WishMap.ProjectCoverImage1,
    description:
      '5底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電',
  },
  {
    id: 6,
    latitude: 24.963929,
    longitude: 121.551897,
    age: 33,
    city_country: '新北市',
    district: '新店區',
    title: '阿佐想擁有手機6',
    total_donation: 100000,
    donation_received: 90000,
    cover_image: ImageProvider.WishMap.ProjectCoverImage1,
    description:
      '6底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電底實就不排果不愛教人麼樣際才發收人而病回不……坐笑定環來男建因學，最黑子目仍物女長叫不家是成青；見部難後通到精物半新臺於一近把開做西表質向不子而相示然關道三進，雙至口議登的為的力：人座子他我不印蘭？都認家又力不我何小變灣由羅質是機顯它電',
  },
];
